import Wrapper from "../../component/wrapper/Wrapper";
import { Table, Tooltip, Input, Button } from 'antd';
import { TextOverflow, FilterWrapper, ActionsWrapper } from './styled-component';
import { PlusOutlined, DeleteOutlined, EditOutlined } from '@ant-design/icons';

const mock = [
    {
        "_id": "61650b052ced4071a969c8bb",
        "plate_number": "1ฒผ-1526",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c8af",
        "plate_number": "1ฒศ-185 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c8b1",
        "plate_number": "1ฒศ-866 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c8a3",
        "plate_number": "2ฒจ-6618 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด/คุณดิถี พุทธิธรกุล<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c8b3",
        "plate_number": "7ว-3905 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด/คุณดิถี พุทธิธรกุล<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c8c3",
        "plate_number": "ฌพ-6028 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด/คุณชนะ วิทย์วรนาถ<br/>19/327 ม.13 แขวงคลองกุ่ม เขตบึงกุ่ม กรุงเทพฯ 10230",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c89f",
        "plate_number": "ฒถ-7993 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c8a1",
        "plate_number": "ฒถ-7994 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c8b5",
        "plate_number": "ฒฬ-8468",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c8ab",
        "plate_number": "ตข-7388 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c8ad",
        "plate_number": "ตท-3470 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c8a7",
        "plate_number": "ตส-1352 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c8a9",
        "plate_number": "ตส-1353 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c893",
        "plate_number": "ถณ-1003 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c8bd",
        "plate_number": "ถต-9157 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c89b",
        "plate_number": "ภล-6768 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด/คุณดิถี พุทธิธรกุล<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c8a5",
        "plate_number": "ภอ-4412 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด/คุณพิไลวรรณ พุทธิธรกุล<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c8bf",
        "plate_number": "ยธ-4029 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c895",
        "plate_number": "ยบ-9056 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c8b7",
        "plate_number": "ยว-9554 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c8b9",
        "plate_number": "ยษ-2110 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c899",
        "plate_number": "รม-7760 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c89d",
        "plate_number": "วว-7140 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c8c1",
        "plate_number": "ษม-1421 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด/คุณภูมิ พุทธิธรกุล<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    },
    {
        "_id": "61650b052ced4071a969c897",
        "plate_number": "ษร-9174 กท",
        "name": "บริษัท ดี เอ็นยีเนียริ่ง จำกัด/คุณดิถี พุทธิธรกุล<br/>206 ถนนศรีนครินทร์ แขวงหัวหมาก เขตบางกะปิ กรุงเทพฯ 10240",
        "__v": 0
    }
];

const columns = [
    {
        title: 'ทะเบียน',
        dataIndex: 'plate_number',
        key: 'plate_number'
    },
    {
        title: 'ชื่อ-ที่อยู่',
        dataIndex: 'name',
        key: 'name',
        render: (text) => (
            <Tooltip title={text}>
                <TextOverflow>{text}</TextOverflow>
            </Tooltip>
        )
    },
    {
        title: 'actions',
        key: 'actions',
        render: (text) => (
            <>
                <Button><EditOutlined /></Button>
            </>
        )
    }
];

const Customer = () => {
    return (
        <>
            <Wrapper page="customer">
                <h1>ลูกค้า</h1>
                <FilterWrapper>
                    <Input placeholder="ทะเบียน" />
                    <Button type="primary">ค้นหา</Button>
                </FilterWrapper>
                <ActionsWrapper>
                    <Button type="primary"><PlusOutlined /></Button>
                    <Button danger><DeleteOutlined /></Button>
                </ActionsWrapper>
                <Table
                    columns={columns}
                    dataSource={mock}
                    rowKey="_id"
                />
            </Wrapper>
        </>
    )
};

export default Customer;